wangfeifei-xsd/fish-tank-terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_LV_COLOR_16_SWAP is not set
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_MEM_SIZE_KILOBYTES=96
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_FISH_TANK_TERMINAL=y
# CONFIG_FISH_MOCK_API is not set
CONFIG_FISH_AUTO_POLL=y
CONFIG_FISH_LOGICAL_WIDTH=1280
CONFIG_FISH_LOGICAL_HEIGHT=720
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/spiffs"
CONFIG_LV_IMG_CACHE_DEF_SIZE=16
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_ENABLE_BT_NIMBLE=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=53
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=54
CONFIG_ESP_HOSTED_SDIO_PIN_D0=49
CONFIG_ESP_HOSTED_SDIO_PIN_D1=50
CONFIG_ESP_HOSTED_SDIO_PIN_D2=51
CONFIG_ESP_HOSTED_SDIO_PIN_D3=52
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=53
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=54
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=49
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=50
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=51
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=52
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=19
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=19
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
